tutorials/multiphaseEuler/bubbleColumnEvaporating/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.gas       1;
    alpha.liquid    0;
}

zones
{
    liquid
    {
        type        box;
        zoneType    cell;

        box         (0 0 0) (0.15 0.501 0.1);

        values
        {
            alpha.gas       0.01;
            alpha.liquid    0.99;
        }
    }
}


// ************************************************************************* //
